// Створюємо об'єкт з трьома властивостями
const myObject = {
    property1: 'ЗСУ',
    property2: 'Завжди',
    property3: 'В сердці',
    
    // Метод, який виводить інформацію про всі властивості об'єкта
    getInfo: function () {
        // Проходимося по кожному ключу в об'єкті
        for (const key in this) {
            // Перевіряємо, чи не є властивість функцією (методом)
            if (typeof this[key] !== 'function') {
                // Виводимо пару "ключ: значення"
                console.log(`${key}: ${this[key]}`);
            }
        }
    },
};

// Викликаємо метод для виведення початкової інформації про об'єкт
myObject.getInfo();

// Додаємо нову властивість до об'єкта
myObject.newProperty = 'Нова властивість!';

// Викликаємо метод для виведення інформації про об'єкт, включаючи нову властивість
myObject.getInfo();